config.org
#+title: Aabm's literate configuration for GNU Emacs
#+author: aabm
#+email: aabm@disroot.org
#+startup: overview
#+property: header-args :tangle config.el

* About

2022 rewrite edition!

This is my personal configuration for GNU Emacs. It is written in a
literate style, combining code snippets and documentation in the same
file.

I use Emacs as my primary computing interface. I write personal notes
and documents with it, and it is central my academic work. This
configuration is where I set all of that up.

In line with the GNU philosophy, this configuration is entirely Free
Software. See the [[file:LICENSE][LICENSE]] file in this repository for more
information.

Some of the major features and characteristics of this configuration
are:

- Declarative package management with ~straight.el~
- Powerful writing workflows with ~org-mode~
- Notetaking according to the /zettelkasten/ method
- Mail, RSS feeds and more!
  
* Minibuffer
** Which Key

The ~which-key~ package uses the minibuffer to display all active
keybindings in the currently typed prefix. It allows you to navigate
your keybindings via prefixes. Nice for when you forget those
cryptically long keychord sequences.

#+begin_src emacs-lisp
  (use-package which-key
    :straight t
    :diminish which-key-mode
    :init
    (which-key-mode)
    :custom
    (which-key-idle-delay 0.4))
#+end_src

** Completion and interface

The Emacs minibuffer is a surprisingly powerful tool. Here we improve
its completion capabilities as well as its interface.

The packages introduced here are:

- ~orderless~, a more advanced completion style, which I find provides
  a better matching experience. So much better, in fact, that we use
  it as the only completion style.
  
- ~vertico~, which provides a completion interface similar to Ivy or
  Helm, that is, vertically ordered and which can be navigated by
  pressing C-n and C-p.

- ~consult~, which provides advanced completion functions, improving
  upon already existing uses. Powerful functions for switching
  buffers, finding bookmarks, searching files, etc.

- ~embark~, which allows one to perform arbitrary actions on
  minibuffer candidates

- ~marginalia~, which displays handy extra information in the
  minibuffer.

#+begin_src emacs-lisp
  (straight-use-package 'orderless)

  (use-package vertico
    :straight t
    :init
    (vertico-mode)
    :custom
    (completion-styles '(substring orderless))
    (completion-ignore-case t)
    (read-file-name-completion-ignore-case t)
    (read-buffer-completion-ignore-case t)
    (enable-recursive-minibuffers t))

  (use-package consult
    :straight t
    :custom
    (consult-narrow-key "<"))

  (use-package embark
    :straight t
    :defer nil
    :custom
    (embark-indicators
     '(embark-highlight-indicator
       embark-verbose-indicator
       embark-isearch-highlight-indicator))
     :bind
     (:map minibuffer-local-map
	   ("C-." . embark-act)))

  (use-package embark-consult
    :straight t)

  (use-package marginalia
    :straight t
    :init
    (marginalia-mode)
    :bind
    ((:map minibuffer-local-map
	   ("M-a" . marginalia-cycle))))
#+end_src

** Isearch editing

This package allows one to edit the isearch query much like any other
minibuffer prompt. Cursor motion commands won't get you out of
isearch.

#+begin_src emacs-lisp
  (use-package isearch-mb
    :straight t
    :diminish isearch-mb-mode
    :init
    (isearch-mb-mode))
#+end_src

* Writing

All packages and settings relating to writing, from simple text
editing features to complex modes like Org.

** Text editing features
*** Auto Fill

When dealing with plain text, I like having my lines automatically
wrapped to a certain threshold. Here we make it so that
~auto-fill-mode~ is used in all plain text editing modes.

#+begin_src emacs-lisp
  (add-hook 'text-mode-hook #'auto-fill-mode)
  (diminish 'auto-fill-function)
#+end_src
 
*** Parens, brackets and quotes
**** Electric pairs

Electric pairs make it so that any opening characters you type
(parentheses, braces, brackets, quotation marks) are automatically
matched with their corresponding closing character. This is handy at all
times when editing, but especially useful for programming in Lisp.

#+begin_src emacs-lisp
  (setq electric-pair-pairs '((?\{ . ?\})
                              (?\( . ?\))
                              (?\[ . ?\])
                              (?\" . ?\")))
  (electric-pair-mode t)
#+end_src

**** Highlight matching parentheses

This minor mode highlights the parentheses corresponding to the one
under/behind point. Useful for Lisp programming.

#+begin_src emacs-lisp
  (show-paren-mode t)
#+end_src
 
*** Casing and capitalization

Here we replace the normal capitalization functions with their
more flexible useful ~dwim~ counterparts.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-c") 'capitalize-dwim)
  (global-set-key (kbd "M-u") 'upcase-dwim)
  (global-set-key (kbd "M-l") 'downcase-dwim)
#+end_src

*** Sentence navigation

A nice tweak to sentence navigation commands that makes them more
usable. We change the definition of a sentence to a more reasonable
"something that ends in a single space after punctuation", instead of
the normal double space. This is superior as quite literally no one
double spaces sentences in ~'(current-year)~.
   
#+begin_src emacs-lisp
  (setq sentence-end-double-space nil)
#+end_src

*** Point position

Enabling the following minor modes makes it so that the position of
point is always displayed in the modeline, as coordinates. It also
enables display of the line numbers on the left of the frame.

#+begin_src emacs-lisp
  (line-number-mode t)
  (column-number-mode t)

  (setq display-line-numbers-type 'relative)
  (add-hook 'text-mode-hook 'display-line-numbers-mode)
  (add-hook 'prog-mode-hook 'display-line-numbers-mode)
#+end_src

*** Expand region

A neat little package that allows marking a region in increasing
bounds with each call. Think of this as a more dynamic version of
Vim's "inside" or "around" commands such as ~di(~. Useful for
selecting things inside parentheses, like in Lisp code, or quotes in
prose.

#+begin_src emacs-lisp
  (use-package expand-region
    :straight t
    :bind
    (("C-=" . er/expand-region)))
#+end_src

*** Multiple cursors

This handy package allows simultaneous editing of multiple lines. It's
particularly useful for batch-renaming files in Dired.

#+begin_src emacs-lisp
  (use-package multiple-cursors
    :straight t)
#+end_src

** Org Mode
*** Editing code blocks

Here we make it so that editing a code block is done in the current
window.

#+begin_src emacs-lisp
  (setq org-src-window-setup 'current-window)
#+end_src

*** Navigating headings

Some settings which make handling Org headings easier: first we make
it so that headings are wrapped by default and that pressing TAB at
the file header cycles all headings. Then we add some convenient
keybindings that allow us to avoid pressing the arrow keys too much.

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-cycle-global-at-bob t)
    (org-startup-folded t))
#+end_src

*** Capture

With ~org-capture~ I can quickly store thoughts in plain text files. I
use this for my agenda and TODO lists as well as my personal journal.

#+begin_src emacs-lisp
      (use-package org
	:custom
	(org-bookmark-names-plist nil)
	(org-todo-keywords '((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d)" "DROP(c)")))
	(org-refile-targets nil)
	(org
	 -agenda-files '("agenda.org" "journal.org"))
	(org-archive-location (format "archive.org::* %s" (format-time-string "%Y")))
	(org-capture-templates
	 '(("j" "Journal entry"
	    entry
	    (file+datetree "journal.org")
	    "* %?"
	    :empty-lines 1)
	   ("t" "TODO"
	    entry
	    (file+headline "agenda.org" "Inbox")
	    "* TODO %?"
	    :empty-lines 1)
	   ("d" "Deadline TODO"
	    entry
	    (file+headline "agenda.org" "Inbox")
	    "* TODO %?\nDEADLINE: %^{Deadline: }T"
	    :empty-lines 1)
	   ("s" "Scheduled TODO"
	    entry
	    (file+headline "agenda.org" "Inbox")
	    "* TODO %?\nSCHEDULED: %^{Scheduled: }T"
	    :empty-lines 1)))
	:config
	(defun aabm/mark-done-and-archive ()
	  "Mark the state of an org-mode item as DONE, archive it, and
      save the Org buffers."
	  (interactive)
	  (org-todo 'done)
	  (org-archive-subtree)
	  (org-save-all-org-buffers)))
#+end_src

*** Custom bullets

To make Org look a bit nicer, we use the ~org-superstar~ package. This
replaces the heading asterisks with custom UTF-8 bullet characters.

#+begin_src emacs-lisp
  (use-package org-superstar
    :straight t
    :hook
    (org-mode-hook . org-superstar-mode))
#+end_src

*** Pretty entities

Prettify some characters.

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-pretty-entities t))
#+end_src

*** Find notes file

#+begin_src emacs-lisp
  (defun org-find-notes-index-file ()
    (interactive)
    (find-file (expand-file-name "index.org" org-directory)))
#+end_src

*** Org Roam

~org-roam~ is a very powerful extension to org-mode. Essentially, it
is a package that maintains a relational database of links between
files, and allows navigation of this database using links and
backlinks. Org Roam is made as a tool for notetaking following the
~zettelkasten~ method. It is incredibly useful tool. I personally
treat it as a second brain, in which I store all the information I
would like to later recall.

We also install ~org-roam-ui~, which runs a local web server for
displaying a visual representation of links between notes. It's quite
fancy.

#+begin_src emacs-lisp
  (use-package org-roam
    :straight t
    :init
    (setq org-roam-directory "~/org/")
    (setq org-roam-v2-ack t)
    :config
    (org-roam-setup)
    :custom
    (org-roam-db-location
     (expand-file-name "roam.db" org-roam-directory))
    (org-roam-capture-templates
     '(("d" "default" plain "%?"
	:if-new (file+head "${slug}.org"
			   "#+title: ${title}\n#+date: %t\n")
	:unnarrowed t)))
    (org-roam-db-update-on-save t))

  (use-package org-roam-ui
    :straight
    (:host github :repo "org-roam/org-roam-ui"
	   :branch "main" :files ("*.el" "out"))
      :after org-roam
      :custom
      (org-roam-ui-sync-theme t)
      (org-roam-ui-follow t)
      (org-roam-ui-update-on-save t)
      (org-roam-ui-open-on-start t))
#+end_src

** Other formats

#+begin_src emacs-lisp
  (use-package markdown-mode
    :straight t)
#+end_src

** Citations

#+begin_src emacs-lisp
  (use-package org
    :custom
    (org-cite-global-bibliography "~/doc/tex/bib/main.bib"))

  (use-package citar
    :straight t
    :custom
    (org-cite-insert-processor 'citar)
    (org-cite-follow-processor 'citar)
    (org-cite-activate-processor 'citar)
    (citar-bibliography org-cite-global-bibliography))
#+end_src

* Reading
** Olivetti

~olivetti-mode~ is a minor mode which centers text on the screen.
Simple as.

#+begin_src emacs-lisp
  (use-package olivetti
    :straight t
    :custom
    (olivetti-body-width 0.72))
#+end_src
