config.el
(use-package which-key
  :straight t
  :diminish which-key-mode
  :init
  (which-key-mode)
  :custom
  (which-key-idle-delay 0.4))

(straight-use-package 'orderless)

(use-package vertico
  :straight t
  :init
  (vertico-mode)
  :custom
  (completion-styles '(substring orderless))
  (completion-ignore-case t)
  (read-file-name-completion-ignore-case t)
  (read-buffer-completion-ignore-case t)
  (enable-recursive-minibuffers t))

(use-package consult
  :straight t
  :custom
  (consult-narrow-key "<"))

(use-package embark
  :straight t
  :custom
  (embark-indicators
   '(embark-highlight-indicator
     embark-verbose-indicator
     embark-isearch-highlight-indicator)))

(use-package embark-consult
  :straight t)

(use-package marginalia
  :straight t
  :init
  (marginalia-mode)
  :bind
  ((:map minibuffer-local-map
	 ("M-a" . marginalia-cycle))))

(use-package isearch-mb
  :straight t
  :diminish isearch-mb-mode
  :init
  (isearch-mb-mode))

(add-hook 'text-mode-hook #'auto-fill-mode)
(diminish 'auto-fill-function)

(setq electric-pair-pairs '((?\{ . ?\})
                            (?\( . ?\))
                            (?\[ . ?\])
                            (?\" . ?\")))
(electric-pair-mode t)

(show-paren-mode t)

(global-set-key (kbd "M-c") 'capitalize-dwim)
(global-set-key (kbd "M-u") 'upcase-dwim)
(global-set-key (kbd "M-l") 'downcase-dwim)

(setq sentence-end-double-space nil)

(line-number-mode t)
(column-number-mode t)

(setq display-line-numbers-type 'relative)
(add-hook 'text-mode-hook 'display-line-numbers-mode)
(add-hook 'prog-mode-hook 'display-line-numbers-mode)

(use-package expand-region
  :straight t
  :bind
  (("C-=" . er/expand-region)))

(use-package multiple-cursors
  :straight t)

(setq org-src-window-setup 'current-window)

(use-package org
  :custom
  (org-cycle-global-at-bob t)
  (org-startup-folded t))

(use-package org
  :custom
  (org-bookmark-names-plist nil)
  (org-todo-keywords '((sequence "TODO(t)" "WAIT(w)" "|" "DONE(d)" "DROP(c)")))
  (org-refile-targets nil)
  (org
   -agenda-files '("agenda.org" "journal.org"))
  (org-archive-location (format "archive.org::* %s" (format-time-string "%Y")))
  (org-capture-templates
   '(("j" "Journal entry"
      entry
      (file+datetree "journal.org")
      "* %?"
      :empty-lines 1)
     ("t" "TODO"
      entry
      (file+headline "agenda.org" "Inbox")
      "* TODO %?"
      :empty-lines 1)
     ("d" "Deadline TODO"
      entry
      (file+headline "agenda.org" "Inbox")
      "* TODO %?\nDEADLINE: %^{Deadline: }T"
      :empty-lines 1)
     ("s" "Scheduled TODO"
      entry
      (file+headline "agenda.org" "Inbox")
      "* TODO %?\nSCHEDULED: %^{Scheduled: }T"
      :empty-lines 1)))
  :config
  (defun aabm/mark-done-and-archive ()
    "Mark the state of an org-mode item as DONE, archive it, and
save the Org buffers."
    (interactive)
    (org-todo 'done)
    (org-archive-subtree)
    (org-save-all-org-buffers)))

(use-package org-superstar
  :straight t
  :hook
  (org-mode-hook . org-superstar-mode))

(use-package org
  :custom
  (org-pretty-entities t))

(use-package org-roam
  :straight t
  :init
  (setq org-roam-directory "~/org/")
  (setq org-roam-v2-ack t)
  :config
  (org-roam-setup)
  :custom
  (org-roam-db-location
   (expand-file-name "roam.db" org-roam-directory))
  (org-roam-capture-templates
   '(("d" "default" plain "%?"
      :if-new (file+head "${slug}.org"
			 "#+title: ${title}\n#+date: %t\n")
      :unnarrowed t)))
  (org-roam-db-update-on-save t))

(use-package org-roam-ui
  :straight
  (:host github :repo "org-roam/org-roam-ui"
	 :branch "main" :files ("*.el" "out"))
    :after org-roam
    :custom
    (org-roam-ui-sync-theme t)
    (org-roam-ui-follow t)
    (org-roam-ui-update-on-save t)
    (org-roam-ui-open-on-start t))

(use-package org
  :custom
  (org-cite-global-bibliography "~/doc/tex/bib/main.bib"))

(use-package citar
  :straight t
  :custom
  (org-cite-insert-processor 'citar)
  (org-cite-follow-processor 'citar)
  (org-cite-activate-processor 'citar)
  (citar-bibliography org-cite-global-bibliography))

(use-package olivetti
  :straight t
  :custom
  (olivetti-body-width 0.72))
