config.org
** Easier window switching

A few commands for easier window switching! First, a better keybinding
for the common ~other-window~ command. Then, we replace the basic
window splitting functions for versions which automatically switch to
the newly created windows.

#+begin_src emacs-lisp
  (global-set-key (kbd "M-o") 'other-window)

  (defun split-window-below-and-switch ()
    "A simple replacement for `split-window-below', which automatically focuses the new window."
    (interactive)
    (split-window-below)
    (other-window 1))

  (defun split-window-right-and-switch ()
    "A simple replacement for `split-window-right', which automatically focuses the new window."
    (interactive)
    (split-window-right)
    (other-window 1))

  (global-set-key (kbd "C-x 2") 'split-window-below-and-switch)
  (global-set-key (kbd "C-x 3") 'split-window-right-and-switch)
#+end_src

** Kill this buffer

Here we make the ~C-x k~ key immediately kill the current buffer
instead of prompting. We do this by making a custom function that is
both simpler and more reliable than the built-in ~kill-this-buffer~. I
don't know why exactly, but that built in never works properly.

#+begin_src emacs-lisp
  (defun kill-this-buffer+ ()
    "Kill the current buffer. More reliable alternative to `kill-this-buffer'"
    (interactive)
    (kill-buffer))

  (global-set-key (kbd "C-x k") 'kill-this-buffer+)
#+end_src

** Switch to other buffer

#+begin_src emacs-lisp
  (defun aabm/other-buffer ()
    (interactive)
    (switch-to-buffer nil))
#+end_src

* Keybindings
** Evil mode

Finally migrating to Vim keys.

#+begin_src emacs-lisp
  (use-package evil
    :straight t
    :init
    (setq evil-want-keybinding nil)
    (evil-mode)
    :custom
    (evil-undo-system 'undo-redo)
    :hook
    (with-editor-mode-hook . evil-insert-state)
    (org-src-mode-hook . evil-insert-state))

  (use-package evil-collection
    :straight t
    :init
    (evil-collection-init))

  (use-package evil-surround
    :straight t
    :config
    (global-evil-surround-mode t))

  (use-package org-evil
    :straight t)

  (use-package evil-org
    :straight t
    :hook
    ((org-mode-hook . evil-org-mode))
    :config
    (require 'evil-org-agenda)
    (evil-org-agenda-set-keys))

  (use-package evil-escape
    :straight t
    :custom
    (evil-escape-key-sequence "jk"))
#+end_src

** General

#+begin_src emacs-lisp
  (use-package general
    :straight t)

  (general-evil-setup)

  (general-nmap
    :states 'normal
    :keymaps 'override
    :prefix "SPC"
    :prefix-map 'leader-map
    ;; files
    "ff" 'find-file
    "fd" 'dired
    "fj" 'dired-jump
    "fc" 'find-emacs-config
    "fo" 'consult-file-externally
    ;; buffers
    "bb" 'consult-buffer
    "bk" 'kill-this-buffer+
    "bK" 'kill-buffer
    "bm" 'consult-bookmark
    "bi" 'ibuffer
    "bo" 'aabm/other-buffer
    ;; git
    "gg" 'magit-status
    "gc" 'magit-commit-all
    "gp" 'magit-push-current-to-pushremote
    "gs" 'vc-git-log-grep
    ;; search
    "sr" 'consult-ripgrep
    "so" 'consult-outline
    "sm" 'consult-mark
    "ss" 'consult-line
    "sl" 'consult-goto-line
    ;; text editing
    "ti" 'indent-region
    "ty" 'consult-yank-from-kill-ring
    "to" 'olivetti-mode
    ;; windows
    "wo" 'other-window
    "wd" 'delete-other-windows
    "wk" 'delete-window
    "wj" 'split-window-below-and-switch
    "wl" 'split-window-right-and-switch
    ;; major modes
    "xe" 'elfeed
    "xs" 'eshell-toggle
    ;; mail
    "mm" 'mu4e
    "mc" 'mu4e-compose-new
    ;;; notes
    ;; basic org
    "nw" 'org-capture
    "na" 'org-agenda
    "nb" 'org-switchb
    ;; roam
    "nn" 'org-find-notes-index-file
    "nf" 'org-roam-node-find
    "ni" 'org-roam-node-insert
    "nB" 'org-roam-buffer-toggle
    "nc" 'org-roam-capture
    "no" 'org-roam-buffer-display-dedicated
    "nI" 'org-id-get-create
    "nA" 'org-roam-alias-add
    "nu" 'org-roam-db-sync
    "ng" 'org-roam-ui-mode
    ;; kill stuff (yes these keys are redundant)
    "kk" 'kill-this-buffer+
    "kb" 'kill-buffer
    "kw" 'delete-window
    ;; other
    "." 'embark-act)

  (general-nmap
    :states 'normal
    :keymaps 'eshell-mode-map
    :prefix ","
    :prefix-map 'local-leader-map
    "y" 'eshell-copy-file-path-at-point
    "f" 'eshell-find-file-at-point
    "o" 'eshell-cat-file-at-point
    "b" 'eshell-put-last-output-to-buffer)
#+end_src

* Appearance
** Font

I like the Iosevka font.

#+begin_src emacs-lisp
  (add-to-list 'default-frame-alist '(font . "Iosevka 11"))
  (set-frame-font "Iosevka 11" nil t)
#+end_src

** Theme

Here we install ~doom-themes~, the theme pack from Doom Emacs, and
enable my preferred theme, ~doom-Iosvkem~.

#+begin_src emacs-lisp
    (use-package doom-themes
      :straight t
      :custom
      (doom-gruvbox-dark-variant 'hard))

    (load-theme 'doom-Iosvkem t)
#+end_src

** Modeline

Fancy looking modeline!

#+begin_src emacs-lisp
  (use-package doom-modeline
    :straight t
    :init
    (doom-modeline-mode)
    :custom
    (doom-modeline-enable-word-count t)
    (doom-modeline-minor-modes nil))
#+end_src
