config.el

(global-set-key (kbd "M-o") 'other-window)

(defun split-window-below-and-switch ()
  "A simple replacement for `split-window-below', which automatically focuses the new window."
  (interactive)
  (split-window-below)
  (other-window 1))

(defun split-window-right-and-switch ()
  "A simple replacement for `split-window-right', which automatically focuses the new window."
  (interactive)
  (split-window-right)
  (other-window 1))

(global-set-key (kbd "C-x 2") 'split-window-below-and-switch)
(global-set-key (kbd "C-x 3") 'split-window-right-and-switch)

(defun kill-this-buffer+ ()
  "Kill the current buffer. More reliable alternative to `kill-this-buffer'"
  (interactive)
  (kill-buffer))

(global-set-key (kbd "C-x k") 'kill-this-buffer+)

(defun aabm/other-buffer ()
  (interactive)
  (switch-to-buffer nil))

(use-package evil
  :straight t
  :init
  (setq evil-want-keybinding nil)
  (evil-mode)
  :custom
  (evil-undo-system 'undo-redo)
  :hook
  (with-editor-mode-hook . evil-insert-state))

(use-package evil-collection
  :straight t
  :init
  (evil-collection-init))

(use-package evil-surround
  :straight t
  :hook
  ((evil-mode-hook . evil-surround-mode)))

(use-package org-evil
  :straight t)

(use-package evil-org
  :straight t
  :hook
  ((org-mode-hook . evil-org-mode))
  :config
  (require 'evil-org-agenda)
  (evil-org-agenda-set-keys))

(use-package evil-escape
  :straight t
  :custom
  (evil-escape-key-sequence "jk"))

(use-package general
  :straight t)

(general-evil-setup)

(general-nmap
  :states 'normal
  :keymaps 'override
  :prefix "SPC"
  :prefix-map 'leader-map
  ;; files
  "ff" 'find-file
  "fd" 'dired
  "fj" 'dired-jump
  "fc" 'find-emacs-config
  "fo" 'consult-file-externally
  ;; buffers
  "bb" 'consult-buffer
  "bk" 'kill-this-buffer+
  "bK" 'kill-buffer
  "bm" 'consult-bookmark
  "bi" 'ibuffer
  "bo" 'aabm/other-buffer
  ;; git
  "gg" 'magit-status
  "gc" 'magit-commit-all
  "gp" 'magit-push-current-to-pushremote
  "gs" 'vc-git-log-grep
  ;; search
  "sr" 'consult-ripgrep
  "so" 'consult-outline
  "sm" 'consult-mark
  "ss" 'consult-line
  "sl" 'consult-goto-line
  ;; text editing
  "ti" 'indent-region
  "ty" 'consult-yank-from-kill-ring
  "to" 'olivetti-mode
  ;; windows
  "wo" 'other-window
  "wd" 'delete-other-windows
  "wk" 'delete-window
  "wj" 'split-window-below-and-switch
  "wl" 'split-window-right-and-switch
  ;; major modes
  "xe" 'elfeed
  ;; mail
  "mm" 'mu4e
  "mc" 'mu4e-compose-new
  ;;; notes
  ;; basic org
  "nw" 'org-capture
  "na" 'org-agenda
  "nb" 'org-switchb
  ;; roam
  "nf" 'org-roam-node-find
  "ni" 'org-roam-node-insert
  "nB" 'org-roam-buffer-toggle
  "nc" 'org-roam-capture
  "no" 'org-roam-buffer-display-dedicated
  "nI" 'org-id-get-create
  "nA" 'org-roam-alias-add
  "nu" 'org-roam-db-sync
  "ng" 'org-roam-ui-mode
  ;; other
  "." 'embark-act)

(add-to-list 'default-frame-alist '(font . "Iosevka 11"))
(set-frame-font "Iosevka 11" nil t)

(use-package doom-themes
  :straight t
  :custom
  (doom-gruvbox-dark-variant 'hard))

(load-theme 'doom-Iosvkem t)

(use-package doom-modeline
  :straight t
  :init
  (doom-modeline-mode)
  :custom
  (doom-modeline-enable-word-count t)
  (doom-modeline-minor-modes nil))
